//Напишите программу, которая на вход принимает трехзначное число и на выходе показывает последнюю цифру этого числа.
int a = 582;
int reminder = a % 10;
Console.WriteLine(reminder);