//Напишите программу, которая на вход принимает трехзначное число и на выходе показывает последнюю цифру этого числа.
int a = 584;
int remainder = a % 10;
Console.WriteLine(remainder);